Importing data from a csv file that was created through mysql

In [2]:
import pandas as pd 
import csv
import numpy as np
Movies = pd.read_csv(r'C:\Users\saul\Desktop\week7csv.csv', index_col=0)

Movies.head()

        Thor  Moana  Wonder Woman  Jurassic World  Venom  Lucy
Person
Carlos     2    NaN           3.0             4.0      5     1
Tom        5    1.0           4.0             2.0      1     1
Logan      3    2.0           NaN             NaN      4     1
Phil       5    NaN           NaN             NaN      3     5
Adrien     3    5.0           5.0             1.0      2     3

Average by movie

In [3]:
Rating_By_Movie = Movies.mean()
Rating_By_Movie

Thor              3.600000
Moana             2.666667
Wonder Woman      4.000000
Jurassic World    2.333333
Venom             3.000000
Lucy              2.200000
dtype: float64

Average by viewer

In [4]:
Rating_By_Person = Movies.mean(axis=1)
Rating_By_Person

Person
Carlos    3.000000
Tom       2.333333
Logan     2.500000
Phil      4.333333
Adrien    3.166667
dtype: float64

Normalize the Data

In [5]:

Normalize = (Movies - Movies.min()) / (Movies.max() - Movies.min())
Normalize

            Thor  Moana  Wonder Woman  Jurassic World  Venom  Lucy
Person
Carlos  0.000000    NaN           0.0        1.000000   1.00   0.0
Tom     1.000000   0.00           0.5        0.333333   0.00   0.0
Logan   0.333333   0.25           NaN             NaN   0.75   0.0
Phil    1.000000    NaN           NaN             NaN   0.50   1.0
Adrien  0.333333   1.00           1.0        0.000000   0.25   0.5

Average Normalized movie ratings

In [7]:
Average_Movie_N = Normalize.mean()
Average_Movie_N

Thor              0.533333
Moana             0.416667
Wonder Woman      0.500000
Jurassic World    0.444444
Venom             0.500000
Lucy              0.300000
dtype: float64

Average Normalized rating by person

In [8]:
Average_Person = Normalize.mean(axis=1)
Average_Person

Person
Carlos    0.400000
Tom       0.305556
Logan     0.333333
Phil      0.833333
Adrien    0.513889
dtype: float64

Normalizing the data will help with elminiating the outliers. By having less data to process, the code can run faster and give the user the desired result. On the other hand we also eliminate the actual rating that the indivdaul had for that movie because we are using statics where it fals between 1 and zero.

Standarize by Movie

In [17]:
standardized = (Movies - Movies.mean()) / Movies.std()
standardized

            Thor     Moana  Wonder Woman  Jurassic World     Venom      Lucy
Person
Carlos -1.192570       NaN          -1.0        1.091089  1.264911 -0.670820
Tom     1.043498 -0.800641           0.0       -0.218218 -1.264911 -0.670820
Logan  -0.447214 -0.320256           NaN             NaN  0.632456 -0.670820
Phil    1.043498       NaN           NaN             NaN  0.000000  1.565248
Adrien -0.447214  1.120897           1.0       -0.872872 -0.632456  0.447214

Standarized averge by person

In [21]:
s_person = standardized.mean(axis=1)
s_person

Person
Carlos   -0.101478
Tom      -0.318515
Logan    -0.201459
Phil      0.869582
Adrien    0.102595
dtype: float64

standarized average by movie

In [23]:
s_movie = standardized.mean()
s_movie

Thor             -8.881784e-17
Moana             7.401487e-17
Wonder Woman      0.000000e+00
Jurassic World   -1.110223e-16
Venom             0.000000e+00
Lucy             -8.881784e-17
dtype: float64